cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Quick and Easy Chicken Noodle Soup                                :@soup:
:PROPERTIES:
:export_file_name: quick-and-easy-chicken-noodle-soup
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 10
:export_hugo_custom_front_matter+: :cook-time 30
:export_hugo_custom_front_matter+: :ready-in 40
:export_hugo_custom_front_matter+: :source-url https://www.allrecipes.com/recipe/26460/quick-and-easy-chicken-noodle-soup/
:END:
*** Ingredients

- 1 tablespoon butter
- 1/2 cup chopped onion
- 1/2 cup chopped celery
- 4 (14.5 ounce) cans chicken broth
- 1 (14.5 ounce) can vegetable broth
- 1/2 pound chopped cooked chicken breast
- 1  1/2 cups egg noodles
- 1 cup sliced carrots
- 1/2 teaspoon dried basil
- 1/2 teaspoon dried oregano
- salt and ground black pepper to taste

*** Directions

1. Melt butter in a large pot over medium heat. Add onion and celery and cook until just tender, about 5 minutes.
2. Add chicken broth, vegetable broth, chicken, egg noodles, carrots, basil, oregano, salt, and pepper. Stir to combine and bring to a boil.
3. Reduce heat and simmer for 20 minutes.

