content/recipe/quick-and-easy-chicken-noodle-soup.md
---
title: "Quick and Easy Chicken Noodle Soup"
author: ["Trev"]
lastmod: 2022-05-30T11:03:40-07:00
categories: ["soup"]
draft: false
servings: 6
prep-time: 10
cook-time: 30
ready-in: 40
source-url: "https://www.allrecipes.com/recipe/26460/quick-and-easy-chicken-noodle-soup/"
---

## Ingredients {#ingredients}

-   1 tablespoon butter
-   1/2 cup chopped onion
-   1/2 cup chopped celery
-   4 (14.5 ounce) cans chicken broth
-   1 (14.5 ounce) can vegetable broth
-   1/2 pound chopped cooked chicken breast
-   1  1/2 cups egg noodles
-   1 cup sliced carrots
-   1/2 teaspoon dried basil
-   1/2 teaspoon dried oregano
-   salt and ground black pepper to taste


## Directions {#directions}

1.  Melt butter in a large pot over medium heat. Add onion and celery and cook until just tender, about 5 minutes.
2.  Add chicken broth, vegetable broth, chicken, egg noodles, carrots, basil, oregano, salt, and pepper. Stir to combine and bring to a boil.
3.  Reduce heat and simmer for 20 minutes.